; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-35)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at ball35 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at ball35 room4)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 35
2. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 22 of 35
3. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 22 of 35
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 35
5. (drop ball8 rooma right)
   deleted: (carry ball8 right)
   added: (at ball8 rooma) (free right)
   goals met: 23 of 35
6. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 24 of 35
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 35
8. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 24 of 35
9. (pick ball6 roomb right)
   deleted: (at ball6 roomb) (free right)
   added: (carry ball6 right)
   goals met: 24 of 35
10. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 35
11. (drop ball6 rooma right)
   deleted: (carry ball6 right)
   added: (at ball6 rooma) (free right)
   goals met: 25 of 35
12. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 26 of 35
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 35
14. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 26 of 35
15. (pick ball31 room4 left)
   deleted: (at ball31 room4) (free left)
   added: (carry ball31 left)
   goals met: 26 of 35
16. (pick ball30 room4 right)
   deleted: (at ball30 room4) (free right)
   added: (carry ball30 right)
   goals met: 26 of 35
17. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 26 of 35
18. (drop ball30 room3 right)
   deleted: (carry ball30 right)
   added: (at ball30 room3) (free right)
   goals met: 27 of 35
19. (drop ball31 room3 left)
   deleted: (carry ball31 left)
   added: (at ball31 room3) (free left)
   goals met: 28 of 35
20. (pick ball14 room3 left)
   deleted: (at ball14 room3) (free left)
   added: (carry ball14 left)
   goals met: 28 of 35
21. (pick ball13 room3 right)
   deleted: (at ball13 room3) (free right)
   added: (carry ball13 right)
   goals met: 28 of 35
22. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 28 of 35
23. (drop ball13 roomb right)
   deleted: (carry ball13 right)
   added: (at ball13 roomb) (free right)
   goals met: 29 of 35
24. (drop ball14 roomb left)
   deleted: (carry ball14 left)
   added: (at ball14 roomb) (free left)
   goals met: 30 of 35
25. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 30 of 35
26. (pick ball29 room4 left)
   deleted: (at ball29 room4) (free left)
   added: (carry ball29 left)
   goals met: 30 of 35
27. (pick ball28 room4 right)
   deleted: (at ball28 room4) (free right)
   added: (carry ball28 right)
   goals met: 30 of 35
28. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 30 of 35
29. (drop ball28 room3 right)
   deleted: (carry ball28 right)
   added: (at ball28 room3) (free right)
   goals met: 31 of 35
30. (drop ball29 room3 left)
   deleted: (carry ball29 left)
   added: (at ball29 room3) (free left)
   goals met: 32 of 35
31. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 32 of 35
32. (pick ball27 room4 left)
   deleted: (at ball27 room4) (free left)
   added: (carry ball27 left)
   goals met: 32 of 35
33. (pick ball26 room4 right)
   deleted: (at ball26 room4) (free right)
   added: (carry ball26 right)
   goals met: 32 of 35
34. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 32 of 35
35. (drop ball26 room3 right)
   deleted: (carry ball26 right)
   added: (at ball26 room3) (free right)
   goals met: 33 of 35
36. (drop ball27 room3 left)
   deleted: (carry ball27 left)
   added: (at ball27 room3) (free left)
   goals met: 34 of 35
37. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 34 of 35
38. (pick ball25 room4 left)
   deleted: (at ball25 room4) (free left)
   added: (carry ball25 left)
   goals met: 34 of 35
39. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 34 of 35
40. (drop ball25 room3 left)
   deleted: (carry ball25 left)
   added: (at ball25 room3) (free left)
   goals met: 35 of 35
